# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [2]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders` from Ironhack's database into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [3]:
orders = pd.read_csv("orders.csv", sep = ";")
orders.head()

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [4]:
# Sub Problem 1: How to aggregate the  amount_spent for unique customers?

# Create array that groups by Customer ID and sums the amount spent
customerID_orders = orders.groupby(["CustomerID"]).sum()
customerID_orders.head()

,index,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
12346,37126,541431,2011,1,2,10,74215,1.04,77183.60
12347,30294108,101296926,365971,1383,441,2219,2458,481.21,4310.00
12348,1900064,16869685,62324,257,111,472,2341,178.71,1797.24
12349,26148016,42165457,146803,803,73,657,631,605.10,1757.55
12350,838678,9231629,34187,34,51,272,197,65.30,334.40

In [5]:
# Select only the CustomerID and amount_spent columns (as the numbers of the other ones don't make sense)
customerID_orders = customerID_orders[["amount_spent"]]
customerID_orders.head()

            amount_spent
CustomerID
12346           77183.60
12347            4310.00
12348            1797.24
12349            1757.55
12350             334.40

In [6]:
# Sub Problem 2: How to select customers whose aggregated amount_spent is in a given quantile range?

# Calculate the value for the 0.95 quantile
customerID_orders.quantile(.95)

amount_spent    5840.182
Name: 0.95, dtype: float64

In [7]:
# Select the CustomerID's that are superior to 0.95 quantile
quantile_95_custID = customerID_orders.loc[(customerID_orders['amount_spent'] >= 5840.182)]
quantile_95_custID.head()
# Show the first five Customers with the highest amount spent
# quantile_95_custID.sort_values(by=['amount_spent'], ascending=False).head()

            amount_spent
CustomerID
12346           77183.60
12357            6207.67
12359            6372.58
12409           11072.67
12415          124914.53

In [8]:
# Calculate the value for the 0.75 quantile
customerID_orders.quantile(.75)

amount_spent    1661.64
Name: 0.75, dtype: float64

In [9]:
# Select the CustomerID's that are between 0.95 and 0.75 quantile
quantile_75_95_custID = customerID_orders.loc[(customerID_orders['amount_spent'] >= 1661.64) & (customerID_orders['amount_spent'] < 5840.182)]
quantile_75_95_custID.head()
# Show the first five Preferred Customers that have spent the most money 
# quantile_75_95_custID.sort_values(by=['amount_spent'], ascending=False).head()

            amount_spent
CustomerID
12347            4310.00
12348            1797.24
12349            1757.55
12352            2506.04
12356            2811.43

In [10]:
# Add a column named Customer_profile to the above dataframes with "VIP Customer" and "Preferred Customers" labels

In [11]:
quantile_95_custID["Customer_profile"] = "VIP Customer"

/home/linuxbrew/.linuxbrew/Cellar/ipython/7.5.0/libexec/vendor/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [12]:
# quantile_95_custID.loc[:,'Customer_profile'] = "VIP Customer"

In [13]:
quantile_95_custID.head()

            amount_spent Customer_profile
CustomerID
12346           77183.60     VIP Customer
12357            6207.67     VIP Customer
12359            6372.58     VIP Customer
12409           11072.67     VIP Customer
12415          124914.53     VIP Customer

In [14]:
quantile_75_95_custID["Customer_profile"] = "Preferred Customer"

/home/linuxbrew/.linuxbrew/Cellar/ipython/7.5.0/libexec/vendor/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [15]:
quantile_75_95_custID.head()

            amount_spent    Customer_profile
CustomerID
12347            4310.00  Preferred Customer
12348            1797.24  Preferred Customer
12349            1757.55  Preferred Customer
12352            2506.04  Preferred Customer
12356            2811.43  Preferred Customer

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [16]:
# Get a dataframe that gives the country for each CustomerID
customerID_country = orders[["CustomerID", "Country"]].groupby("CustomerID").first()
customerID_country.head()

                   Country
CustomerID
12346       United Kingdom
12347              Iceland
12348              Finland
12349                Italy
12350               Norway

In [17]:
# Merge the 2 dataframes in order to know which country has got more VIP Customers
VIPcustomer_country = pd.concat([quantile_95_custID, customerID_country], axis=1, sort=False)
VIPcustomer_country.head()

            amount_spent Customer_profile         Country
CustomerID
12346            77183.6     VIP Customer  United Kingdom
12347                NaN              NaN         Iceland
12348                NaN              NaN         Finland
12349                NaN              NaN           Italy
12350                NaN              NaN          Norway

In [18]:
# Drop the NaN values from the previous dataframe
VIPcustomer_country = VIPcustomer_country.dropna()
VIPcustomer_country.head()

            amount_spent Customer_profile         Country
CustomerID
12346           77183.60     VIP Customer  United Kingdom
12357            6207.67     VIP Customer     Switzerland
12359            6372.58     VIP Customer          Cyprus
12409           11072.67     VIP Customer     Switzerland
12415          124914.53     VIP Customer       Australia

In [24]:
# Find the countries that have the most amount of VIP Customers
country_count_VIP = VIPcustomer_country["Country"].value_counts()
print(country_count_VIP)

United Kingdom     177
Germany             10
France               9
Switzerland          3
Australia            2
Spain                2
Japan                2
EIRE                 2
Portugal             2
Denmark              1
Channel Islands      1
Netherlands          1
Finland              1
Singapore            1
Cyprus               1
Norway               1
Sweden               1
Name: Country, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [26]:
# we need to concatenate the VIP Costumers and the Preferred Costumer tables
VIP_preferred_costumers = pd.concat([quantile_95_custID, quantile_75_95_custID])
VIP_preferred_costumers.head()

            amount_spent Customer_profile
CustomerID
12346           77183.60     VIP Customer
12357            6207.67     VIP Customer
12359            6372.58     VIP Customer
12409           11072.67     VIP Customer
12415          124914.53     VIP Customer

In [28]:
# By checking the various shapes I can see that the VIP-preferred_costumers dataframe is bigger than 
# quantile_95_custID.shape
VIP_preferred_costumers.shape

(1085, 2)

In [29]:
quantile_95_custID.shape

(217, 2)

In [31]:
# I add the country column to the VIP_preferred_costumers dataframe
VIP_preferred_customers_country = pd.concat([VIP_preferred_costumers, customerID_country], axis=1, sort=False)
VIP_preferred_customers_country.head()

            amount_spent    Customer_profile         Country
CustomerID
12346           77183.60        VIP Customer  United Kingdom
12347            4310.00  Preferred Customer         Iceland
12348            1797.24  Preferred Customer         Finland
12349            1757.55  Preferred Customer           Italy
12350                NaN                 NaN          Norway

In [32]:
# I eliminate the NaN's
VIP_preferred_customers_country = VIP_preferred_customers_country.dropna()

In [33]:
# I find the countries that have the most amount of VIP  and Preferred Customers
country_count_VIP_preferred = VIP_preferred_customers_country["Country"].value_counts()
print(country_count_VIP_preferred)

United Kingdom     932
Germany             39
France              29
Belgium             11
Switzerland          9
Spain                7
Portugal             7
Norway               7
Finland              5
Italy                5
Channel Islands      4
Japan                4
Australia            4
Cyprus               3
EIRE                 3
Denmark              3
Israel               2
Sweden               2
Singapore            1
Lebanon              1
Iceland              1
Poland               1
Canada               1
Malta                1
Austria              1
Greece               1
Netherlands          1
Name: Country, dtype: int64